// =====================================================
// Гра: Find Next
// Набір: data-003
//
// Тема:
// Незвичайні арифметичні закономірності.
//
// Використовуються:
// • змінний крок;
// • квадрати;
// • куби;
// • степені двійки.
//
// Рівень складності:
// ★★☆☆☆
//
// Автор: Граймонт
// =====================================================

const info = {
  title: "Незвичайні числові послідовності",

  instruction: "Варіанти для завершення ряду",
};

const tasks = [
  // +2, +3, +4
  {
    sequence: [2, 4, 7, 11, null],
    options: [15, 16, 17, 18],
    correct: 1,
  },

  // -3, -4, -5
  {
    sequence: [30, 27, 23, 18, null],
    options: [12, 13, 14, 15],
    correct: 0,
  },

  // ×2
  {
    sequence: [2, 4, 8, 16, null],
    options: [30, 32, 34, 36],
    correct: 1,
  },

  // ÷2
  {
    sequence: [128, 64, 32, 16, null],
    options: [6, 8, 10, 12],
    correct: 1,
  },

  // Квадрати
  {
    sequence: [1, 4, 9, 16, null],
    options: [20, 24, 25, 27],
    correct: 2,
  },

  // Куби
  {
    sequence: [1, 8, 27, 64, null],
    options: [81, 100, 125, 216],
    correct: 2,
  },

  // +5, +10, +15
  {
    sequence: [5, 10, 20, 35, null],
    options: [45, 50, 55, 60],
    correct: 2,
  },

  // -2, -4, -8
  {
    sequence: [3, 5, 9, 17, null],
    options: [25, 31, 33, 35],
    correct: 2
  },

  // ×3
  {
    sequence: [1, 3, 9, 27, null],
    options: [54, 72, 81, 108],
    correct: 2,
  },

  // ÷3
  {
    sequence: [243, 81, 27, 9, null],
    options: [1, 2, 3, 6],
    correct: 2,
  },

  // +1, +2, +3, +4
  {
    sequence: [10, 11, 13, 16, null],
    options: [19, 20, 21, 22],
    correct: 1,
  },

  // ×2 +1
  {
    sequence: [2, 5, 11, 23, null],
    options: [45, 46, 47, 48],
    correct: 2,
  },
];
