// =====================================================
// Гра: Find Next
// Набір: data-001
//
// Тема:
// Прості арифметичні закономірності.
//
// Використовуються:
// • додавання;
// • віднімання;
// • множення;
// • ділення.
//
// Рівень складності:
// ★☆☆☆☆
//
// Автор: Граймонт
// =====================================================
const info = {
  id: "set-001",
  title: "* Прості числові послідовності *",
  instruction: "Варіанти для завершення ряду",
  description: "Перший випуск гри Find Next.",
  author: "Валерій Мусієнко",
  version: "1.0",
  created: "2026-07-13",
  published: null,
  difficulty: "easy",
  contentType: "number",
};

const tasks = [
  {
    sequence: [2, 4, 6, "?"],
    options: [8, 9, 10, 12],
    correct: 0,
  },

  {
    sequence: [5, 10, 15, "?"],
    options: [18, 20, 25, 30],
    correct: 1,
  },

  {
    sequence: [1, 2, 4, 8, "?"],
    options: [10, 12, 14, 16],
    correct: 3,
  },

  {
    sequence: [20, 18, 16, "?"],
    options: [15, 14, 13, 12],
    correct: 1,
  },

  {
    sequence: [3, 6, 9, 12, "?"],
    options: [14, 15, 16, 18],
    correct: 1,
  },

  {
    sequence: [1, 4, 9, 16, "?"],
    options: [20, 24, 25, 36],
    correct: 2,
  },
];
