// =====================================================
// Гра: Find Next
// Набір: data-005
//
// Тема:
// Логічні та математичні закономірності.
//
// Рівень:
// ★★★★☆
//
// Автор: Граймонт
// =====================================================

export const info = {
  title: "Логічні числові послідовності",

  instruction: "Варіанти для завершення ряду",
};

export const tasks = [
  // Фібоначчі
  {
    sequence: [3, 5, 8, 13, null],
    options: [18, 20, 21, 22],
    correct: 2,
  },

  // Коллатц
  {
    sequence: [7, 22, 11, 34, null],
    options: [16, 17, 18, 19],
    correct: 1,
  },

  // ×2 −1
  {
    sequence: [4, 7, 13, 25, null],
    options: [47, 48, 49, 50],
    correct: 2,
  },

  // Квадрати простих чисел
  {
    sequence: [4, 9, 25, 49, null],
    options: [81, 100, 121, 169],
    correct: 3,
  },

  // Степені трійки
  {
    sequence: [3, 9, 27, 81, null],
    options: [162, 243, 324, 729],
    correct: 1,
  },

  // ×3 −2
  {
    sequence: [2, 4, 10, 28, null],
    options: [80, 82, 84, 86],
    correct: 1,
  },

  // Трикутні числа
  {
    sequence: [3, 6, 10, 15, null],
    options: [18, 20, 21, 22],
    correct: 2,
  },

  // Подвоєння приросту
  {
    sequence: [2, 6, 14, 30, null],
    options: [60, 62, 64, 66],
    correct: 1,
  },

  // Куби
  {
    sequence: [8, 27, 64, 125, null],
    options: [196, 216, 225, 256],
    correct: 1,
  },

  // Дві переплетені послідовності
  {
    sequence: [2, 10, 4, 20, 6, null],
    options: [24, 28, 30, 40],
    correct: 2,
  },

  // ×2 +3
  {
    sequence: [2, 7, 17, 37, null],
    options: [75, 76, 77, 78],
    correct: 2,
  },

  // Факторіали
  {
    sequence: [1, 2, 6, 24, null],
    options: [96, 100, 120, 144],
    correct: 2,
  },
];
