// =====================================================
// Гра: Find Next
// Набір: data-002
//
// Тема:
// Прості арифметичні закономірності.
//
// Використовуються:
// • додавання;
// • віднімання;
// • множення;
// • ділення.
//
// Рівень складності:
// ★☆☆☆☆
//
// Автор: Граймонт
// =====================================================

export const info = {
  title: "Прості числові послідовності",

  instruction: "Варіанти для завершення ряду",
};

export const tasks = [
  {
    sequence: [5, 10, 15, null],
    options: [20, 18, 25, 30],
    correct: 0,
  },

  {
    sequence: [40, 35, 30, null],
    options: [20, 25, 28, 15],
    correct: 1,
  },

  {
    sequence: [3, 6, 12, null],
    options: [18, 21, 24, 30],
    correct: 2,
  },

  {
    sequence: [81, 27, 9, null],
    options: [6, 4, 3, 1],
    correct: 2,
  },

  {
    sequence: [2, 5, 8, null],
    options: [10, 11, 12, 13],
    correct: 1,
  },

  {
    sequence: [100, 90, 80, null],
    options: [75, 70, 60, 65],
    correct: 1,
  },
];
